{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_220_input"}, "name": "dense_220_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_224_input"}, "name": "dense_224_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_228_input"}, "name": "dense_228_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_232_input"}, "name": "dense_232_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_236_input"}, "name": "dense_236_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_220", "trainable": false, "batch_input_shape": [null, 23], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_220", "inbound_nodes": [[["dense_220_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_224", "trainable": false, "batch_input_shape": [null, 23], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_224", "inbound_nodes": [[["dense_224_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_228", "trainable": false, "batch_input_shape": [null, 23], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_228", "inbound_nodes": [[["dense_228_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_232", "trainable": false, "batch_input_shape": [null, 23], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_232", "inbound_nodes": [[["dense_232_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_236", "trainable": false, "batch_input_shape": [null, 23], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_236", "inbound_nodes": [[["dense_236_input", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_110", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_110", "inbound_nodes": [[["dense_220", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_112", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_112", "inbound_nodes": [[["dense_224", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_114", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_114", "inbound_nodes": [[["dense_228", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_116", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_116", "inbound_nodes": [[["dense_232", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_118", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_118", "inbound_nodes": [[["dense_236", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_221", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_221", "inbound_nodes": [[["dropout_110", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_225", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_225", "inbound_nodes": [[["dropout_112", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_229", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_229", "inbound_nodes": [[["dropout_114", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_233", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_233", "inbound_nodes": [[["dropout_116", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_237", "trainable": false, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_237", "inbound_nodes": [[["dropout_118", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_111", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_111", "inbound_nodes": [[["dense_221", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_113", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_113", "inbound_nodes": [[["dense_225", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_115", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_115", "inbound_nodes": [[["dense_229", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_117", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_117", "inbound_nodes": [[["dense_233", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_119", "trainable": false, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_119", "inbound_nodes": [[["dense_237", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_222", "trainable": false, "dtype": "float32", "units": 23, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_222", "inbound_nodes": [[["dropout_111", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_226", "trainable": false, "dtype": "float32", "units": 23, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_226", "inbound_nodes": [[["dropout_113", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_230", "trainable": false, "dtype": "float32", "units": 23, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_230", "inbound_nodes": [[["dropout_115", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_234", "trainable": false, "dtype": "float32", "units": 23, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_234", "inbound_nodes": [[["dropout_117", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_238", "trainable": false, "dtype": "float32", "units": 23, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_238", "inbound_nodes": [[["dropout_119", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_223", "trainable": false, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_223", "inbound_nodes": [[["dense_222", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_227", "trainable": false, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_227", "inbound_nodes": [[["dense_226", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_231", "trainable": false, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_231", "inbound_nodes": [[["dense_230", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_235", "trainable": false, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_235", "inbound_nodes": [[["dense_234", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_239", "trainable": false, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_239", "inbound_nodes": [[["dense_238", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["dense_223", 0, 0, {}], ["dense_227", 0, 0, {}], ["dense_231", 0, 0, {}], ["dense_235", 0, 0, {}], ["dense_239", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_240", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_240", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_241", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_241", "inbound_nodes": [[["dense_240", 0, 0, {}]]]}], "input_layers": [["dense_220_input", 0, 0], ["dense_224_input", 0, 0], ["dense_228_input", 0, 0], ["dense_232_input", 0, 0], ["dense_236_input", 0, 0]], "output_layers": [["dense_241", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}